Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.ViewCameraExtensionsImports
Wrapper class for Tekla.Structures.DirectManipulation.Adapter.Graphics.ViewCameraExtensions imports.

Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.ViewCameraExtensionsImports.DotExportSelectViewClippingPlanes(System.Int32,Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotViewClippingPlanes_t@)
Selects the clipping planes of the view with the given viewId.
viewId: The identifier of the view to get the clipping planes for.
viewClippingPlanes: The clipping planes of the view.
Returns: Greater than 0 on success.